const motores = [
  {
    cv: 0.16,
    kw: 0.12,
    polos: {
      "2p": { η: 62.0, cosφ: 0.68, ip_in: 6.6 },
      "4p": { η: 66.0, cosφ: 0.68, ip_in: 4.8 },
      "6p": { η: 64.0, cosφ: 0.59, ip_in: 3.4 },
      "8p": { η: 59.5, cosφ: 0.49, ip_in: 2.8 }
    }
  },
  {
    cv: 0.25,
    kw: 0.18,
    polos: {
      "2p": { η: 65.6, cosφ: 0.75, ip_in: 6.0 },
      "4p": { η: 69.5, cosφ: 0.70, ip_in: 5.0 },
      "6p": { η: 67.5, cosφ: 0.59, ip_in: 3.2 },
      "8p": { η: 64.0, cosφ: 0.62, ip_in: 3.4 }
    }
  },
  {
    cv: 0.33,
    kw: 0.25,
    polos: {
      "2p": { η: 69.5, cosφ: 0.80, ip_in: 5.9 },
      "4p": { η: 73.4, cosφ: 0.66, ip_in: 5.5 },
      "6p": { η: 69.0, cosφ: 0.59, ip_in: 3.3 },
      "8p": { η: 68.0, cosφ: 0.63, ip_in: 3.7 }
    }
  },
  {
    cv: 0.5,
    kw: 0.37,
    polos: {
      "2p": { η: 73.4, cosφ: 0.83, ip_in: 5.8 },
      "4p": { η: 78.2, cosφ: 0.70, ip_in: 5.1 },
      "6p": { η: 75.3, cosφ: 0.75, ip_in: 4.3 },
      "8p": { η: 72.0, cosφ: 0.60, ip_in: 4.2 }
    }
  },
  {
    cv: 0.75,
    kw: 0.55,
    polos: {
      "2p": { η: 76.8, cosφ: 0.83, ip_in: 6.3 },
      "4p": { η: 79.0, cosφ: 0.66, ip_in: 5.3 },
      "6p": { η: 79.5, cosφ: 0.74, ip_in: 4.9 },
      "8p": { η: 74.0, cosφ: 0.60, ip_in: 4.4 }
    }
  },
  {
    cv: 1.0,
    kw: 0.75,
    polos: {
      "2p": { η: 80.5, cosφ: 0.84, ip_in: 6.6 },
      "4p": { η: 83.0, cosφ: 0.82, ip_in: 7.3 },
      "6p": { η: 82.5, cosφ: 0.70, ip_in: 5.6 },
      "8p": { η: 75.5, cosφ: 0.60, ip_in: 4.1 }
    }
  },
  {
    cv: 1.5,
    kw: 1.1,
    polos: {
      "2p": { η: 84.0, cosφ: 0.83, ip_in: 8.4 },
      "4p": { η: 84.0, cosφ: 0.80, ip_in: 7.4 },
      "6p": { η: 87.5, cosφ: 0.68, ip_in: 6.5 },
      "8p": { η: 78.5, cosφ: 0.61, ip_in: 4.6 }
    }
  },
  {
    cv: 2.0,
    kw: 1.5,
    polos: {
      "2p": { η: 85.5, cosφ: 0.85, ip_in: 7.8 },
      "4p": { η: 86.5, cosφ: 0.80, ip_in: 7.7 },
      "6p": { η: 86.5, cosφ: 0.71, ip_in: 6.1 },
      "8p": { η: 84.0, cosφ: 0.70, ip_in: 5.3 }
    }
  },
  {
    cv: 3.0,
    kw: 2.2,
    polos: {
      "2p": { η: 86.5, cosφ: 0.85, ip_in: 7.8 },
      "4p": { η: 87.5, cosφ: 0.80, ip_in: 7.4 },
      "6p": { η: 87.0, cosφ: 0.71, ip_in: 6.3 },
      "8p": { η: 85.5, cosφ: 0.73, ip_in: 6.5 }
    }
  },
  {
    cv: 4.0,
    kw: 3.0,
    polos: {
      "2p": { η: 88.5, cosφ: 0.82, ip_in: 8.2 },
      "4p": { η: 89.5, cosφ: 0.77, ip_in: 9.1 },
      "6p": { η: 89.5, cosφ: 0.72, ip_in: 7.2 },
      "8p": { η: 86.5, cosφ: 0.72, ip_in: 6.8 }
    }
  },
  {
    cv: 5.0,
    kw: 3.7,
    polos: {
      "2p": { η: 88.5, cosφ: 0.86, ip_in: 8.2 },
      "4p": { η: 89.5, cosφ: 0.77, ip_in: 8.3 },
      "6p": { η: 89.5, cosφ: 0.71, ip_in: 7.5 },
      "8p": { η: 86.5, cosφ: 0.72, ip_in: 6.5 }
    }
  },
  {
    cv: 6.0,
    kw: 4.5,
    polos: {
      "2p": { η: 88.5, cosφ: 0.87, ip_in: 7.6 },
      "4p": { η: 89.5, cosφ: 0.80, ip_in: 7.0 },
      "6p": { η: 89.5, cosφ: 0.72, ip_in: 6.7 },
      "8p": { η: 86.5, cosφ: 0.69, ip_in: 5.1 }
    }
  },
  {
    cv: 7.5,
    kw: 5.5,
    polos: {
      "2p": { η: 89.5, cosφ: 0.83, ip_in: 8.2 },
      "4p": { η: 91.0, cosφ: 0.78, ip_in: 7.3 },
      "6p": { η: 91.0, cosφ: 0.73, ip_in: 7.5 },
      "8p": { η: 86.5, cosφ: 0.71, ip_in: 5.0 }
    }
  },
  {
    cv: 10.0,
    kw: 7.5,
    polos: {
      "2p": { η: 90.2, cosφ: 0.87, ip_in: 8.1 },
      "4p": { η: 91.7, cosφ: 0.84, ip_in: 8.2 },
      "6p": { η: 91.0, cosφ: 0.73, ip_in: 7.3 },
      "8p": { η: 89.5, cosφ: 0.71, ip_in: 5.0 }
    }
  },
  {
    cv: 12.5,
    kw: 9.0,
    polos: {
      "2p": { η: 91.0, cosφ: 0.89, ip_in: 8.1 },
      "4p": { η: 92.4, cosφ: 0.84, ip_in: 8.5 },
      "6p": { η: 91.7, cosφ: 0.78, ip_in: 6.3 },
      "8p": { η: 89.5, cosφ: 0.78, ip_in: 6.8 }
    }
  },
  {
    cv: 15.0,
    kw: 11.0,
    polos: {
      "2p": { η: 91.0, cosφ: 0.86, ip_in: 8.4 },
      "4p": { η: 92.4, cosφ: 0.83, ip_in: 8.3 },
      "6p": { η: 91.7, cosφ: 0.80, ip_in: 7.0 },
      "8p": { η: 89.5, cosφ: 0.78, ip_in: 7.0 }
    }
  },
  {
    cv: 20.0,
    kw: 15.0,
    polos: {
      "2p": { η: 91.0, cosφ: 0.87, ip_in: 7.6 },
      "4p": { η: 93.0, cosφ: 0.81, ip_in: 9.0 },
      "6p": { η: 91.7, cosφ: 0.80, ip_in: 6.8 },
      "8p": { η: 90.2, cosφ: 0.79, ip_in: 7.3 }
    }
  },
  {
    cv: 25.0,
    kw: 18.5,
    polos: {
      "2p": { η: 91.7, cosφ: 0.87, ip_in: 8.3 },
      "4p": { η: 93.6, cosφ: 0.81, ip_in: 7.3 },
      "6p": { η: 93.0, cosφ: 0.84, ip_in: 8.5 },
      "8p": { η: 90.2, cosφ: 0.73, ip_in: 4.5 }
    }
  },
  {
    cv: 30.0,
    kw: 22.0,
    polos: {
      "2p": { η: 91.7, cosφ: 0.86, ip_in: 9.0 },
      "4p": { η: 93.6, cosφ: 0.81, ip_in: 8.0 },
      "6p": { η: 93.0, cosφ: 0.81, ip_in: 6.5 },
      "8p": { η: 91.7, cosφ: 0.81, ip_in: 6.7 }
    }
  },
  {
    cv: 40.0,
    kw: 30.0,
    polos: {
      "2p": { η: 92.4, cosφ: 0.86, ip_in: 6.7 },
      "4p": { η: 94.1, cosφ: 0.84, ip_in: 7.0 },
      "6p": { η: 94.1, cosφ: 0.79, ip_in: 6.7 },
      "8p": { η: 91.7, cosφ: 0.79, ip_in: 6.8 }
    }
  },
  {
    cv: 50.0,
    kw: 37.0,
    polos: {
      "2p": { η: 93.0, cosφ: 0.86, ip_in: 7.6 },
      "4p": { η: 94.5, cosφ: 0.84, ip_in: 6.4 },
      "6p": { η: 94.1, cosφ: 0.84, ip_in: 7.4 },
      "8p": { η: 92.4, cosφ: 0.80, ip_in: 7.3 }
    }
  },
  {
    cv: 60.0,
    kw: 45.0,
    polos: {
      "2p": { η: 93.6, cosφ: 0.83, ip_in: 7.8 },
      "4p": { η: 95.0, cosφ: 0.85, ip_in: 7.5 },
      "6p": { η: 94.5, cosφ: 0.84, ip_in: 7.6 },
      "8p": { η: 92.4, cosφ: 0.80, ip_in: 7.8 }
    }
  },
  {
    cv: 75.0,
    kw: 55.0,
    polos: {
      "2p": { η: 93.6, cosφ: 0.89, ip_in: 7.9 },
      "4p": { η: 95.4, cosφ: 0.86, ip_in: 7.5 },
      "6p": { η: 94.5, cosφ: 0.85, ip_in: 7.6 },
      "8p": { η: 93.6, cosφ: 0.78, ip_in: 6.0 }
    }
  },
  {
    cv: 100.0,
    kw: 75.0,
    polos: {
      "2p": { η: 94.1, cosφ: 0.87, ip_in: 8.9 },
      "4p": { η: 95.4, cosφ: 0.85, ip_in: 8.5 },
      "6p": { η: 95.0, cosφ: 0.83, ip_in: 6.0 },
      "8p": { η: 93.6, cosφ: 0.78, ip_in: 6.0 }
    }
  },
  {
    cv: 125.0,
    kw: 90.0,
    polos: {
      "2p": { η: 95.0, cosφ: 0.88, ip_in: 7.7 },
      "4p": { η: 95.4, cosφ: 0.86, ip_in: 7.6 },
      "6p": { η: 95.0, cosφ: 0.83, ip_in: 6.0 },
      "8p": { η: 94.1, cosφ: 0.79, ip_in: 5.8 }
    }
  },
  {
    cv: 150.0,
    kw: 110.0,
    polos: {
      "2p": { η: 95.0, cosφ: 0.89, ip_in: 7.5 },
      "4p": { η: 95.8, cosφ: 0.86, ip_in: 7.9 },
      "6p": { η: 95.8, cosφ: 0.83, ip_in: 6.6 },
      "8p": { η: 94.1, cosφ: 0.79, ip_in: 5.8 }
    }
  },
  {
    cv: 175.0,
    kw: 130.0,
    polos: {
      "2p": { η: 95.4, cosφ: 0.89, ip_in: 7.4 },
      "4p": { η: 96.2, cosφ: 0.86, ip_in: 7.4 },
      "6p": { η: 95.8, cosφ: 0.83, ip_in: 7.0 },
      "8p": { η: 94.5, cosφ: 0.79, ip_in: 6.0 }
    }
  },
  {
    cv: 200.0,
    kw: 150.0,
    polos: {
      "2p": { η: 95.4, cosφ: 0.88, ip_in: 7.7 },
      "4p": { η: 96.2, cosφ: 0.86, ip_in: 7.8 },
      "6p": { η: 95.8, cosφ: 0.83, ip_in: 6.5 },
      "8p": { η: 94.5, cosφ: 0.79, ip_in: 6.0 }
    }
  },
  {
    cv: 250.0,
    kw: 185.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.89, ip_in: 7.7 },
      "4p": { η: 96.2, cosφ: 0.87, ip_in: 7.6 },
      "6p": { η: 95.8, cosφ: 0.81, ip_in: 6.0 },
      "8p": { η: 95.0, cosφ: 0.80, ip_in: 6.2 }
    }
  },
  {
    cv: 270.0,
    kw: 200.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.90, ip_in: 8.0 },
      "4p": { η: 96.2, cosφ: 0.87, ip_in: 7.3 },
      "6p": { η: 95.8, cosφ: 0.81, ip_in: 6.4 },
      "8p": null
    }
  },
  {
    cv: 300.0,
    kw: 220.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.90, ip_in: 8.2 },
      "4p": { η: 96.2, cosφ: 0.87, ip_in: 7.3 },
      "6p": { η: 95.8, cosφ: 0.81, ip_in: 6.3 },
      "8p": { η: 95.0, cosφ: 0.80, ip_in: 6.0 }
    }
  },
  {
    cv: 350.0,
    kw: 260.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.90, ip_in: 8.0 },
      "4p": { η: 96.2, cosφ: 0.87, ip_in: 7.8 },
      "6p": { η: 95.8, cosφ: 0.81, ip_in: 6.4 },
      "8p": { η: 95.0, cosφ: 0.80, ip_in: 6.3 }
    }
  },
  {
    cv: 400.0,
    kw: 300.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.91, ip_in: 8.4 },
      "4p": { η: 96.2, cosφ: 0.86, ip_in: 7.0 },
      "6p": { η: 95.8, cosφ: 0.80, ip_in: 7.0 },
      "8p": { η: 95.0, cosφ: 0.79, ip_in: 7.4 }
    }
  },
  {
    cv: 450.0,
    kw: 330.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.92, ip_in: 8.4 },
      "4p": { η: 96.2, cosφ: 0.86, ip_in: 7.6 },
      "6p": { η: 95.8, cosφ: 0.80, ip_in: 6.3 },
      "8p": { η: 95.0, cosφ: 0.80, ip_in: 6.8 }
    }
  },
  {
    cv: 500.0,
    kw: 370.0,
    polos: {
      "2p": { η: 95.8, cosφ: 0.88, ip_in: 9.5 },
      "4p": { η: 96.6, cosφ: 0.86, ip_in: 7.4 },
      "6p": { η: 95.8, cosφ: 0.79, ip_in: 6.3 },
      "8p": null
    }
  }
];